Revit 2027 API
BuiltInFailures.SketchFailures.InvalidCropAreaSketchRegen Property
 Crop area sketch can either be empty or include one closed, not self-intersecting loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidCropAreaSketchRegen { get; }
Public Shared ReadOnly Property InvalidCropAreaSketchRegen As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidCropAreaSketchRegen {
	FailureDefinitionId^ get ();
}
static member InvalidCropAreaSketchRegen : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace